constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    inlet
    {
        type            patch;
        nFaces          220;
        startFace       120610;
    }
    outlet
    {
        type            patch;
        nFaces          212;
        startFace       120830;
    }
    upperAndLower
    {
        type            wall;
        inGroups        1(wall);
        nFaces          564;
        startFace       121042;
    }
    rotor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          112;
        startFace       121606;
    }
    stator
    {
        type            wall;
        inGroups        1(wall);
        nFaces          232;
        startFace       121718;
    }
    AMI1
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          48;
        startFace       121950;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI2;
    }
    AMI2
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          48;
        startFace       121998;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI1;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          60664;
        startFace       122046;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          60664;
        startFace       182710;
    }
)

// ************************************************************************* //
